old_app/app/controllers/posts_controller.rb

  def show
    @post = Post.find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE ("posts"."id" = 1) LIMIT 1

  def edit
    @post = Post.find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE ("posts"."id" = 1) LIMIT 1

  def update
    @post = Post.find(params[:id])
    respond_to do |format|
      if @post.update_attributes(params[:post])
---
SELECT "posts".* FROM "posts" WHERE ("posts"."id" = 1) LIMIT 1
UPDATE "posts" SET "content" = 'only preview', "updated_at" = '2010-10-26 10:38:02.431745' WHERE ("posts"."id" = 1)